<!DOCTYPE html>
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=koi8-r">
   <meta name="Author" content="Pavel Puchkov">
   <title>IQ Mueller dictionary</title>
   <style type="text/css">
    a:link{color:#363636;} 
    a:visited {color:#363636;} 
    a:hover {color:#363636;} 
    a:active {color:#363636;}
   </style>

</head>

<body>

<?php
	$word = isset($_POST['word'])?$_POST['word']:"";
	$nbeg = isset($_POST['nbeg'])?($_POST['nbeg']?"CHECKED":""):"";
	$nexact = isset($_POST['nexact'])?($_POST['nexact']?"CHECKED":""):"";
	if (empty($_POST))
	{
	   $nbeg = "CHECKED";
	   $nexact = "CHECKED";
	}
?>

<form action="#" method="post">
<input type="text" name="word" size="40" value="<?php echo $word?>"/>
<input type="submit" value="Поиск"/> 
<br/>
<input type="checkbox" name="nbeg" <?php echo $nbeg?>/>внутри статьи
<input type="checkbox" name="nexact" <?php echo $nexact?>/>внутри слов
<hr>
</form>

<?php

$dictionary = "./Mueller24.koi" ;

$wword = preg_replace ( "[^\*a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]" 
		      , "" , $word ) ; // remove invalid char's
$wword = str_replace ( "*" , "[a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]*" , $wword ) ;

$pref = $nexact ? "" : "([^a-zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]|^)" ;
$suff = $nexact ? "" : "([^a-zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]|$)" ;

if ( $nbeg ) { 
   $sopt = $nexact ?
		    "s/"
                    . $wword
                    . "/<span style=\"color:red; font-weight: bold;\">&<\/span>/g;" 
		   : 
		    "s/^\(".$wword."\)"
		    . "\([^a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]\)"
		    . "/<span style=\"color:red; font-weight: bold;\">\\1<\/span>\\2/g;" 

	            ."s/"
		    . "\([^a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]\)"
                    . "\(".$wword."\)"
		    . "\([^a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]\)"
                    . "/\\1<span style=\"color:red; font-weight: bold;\">\\2<\/span>\\3/g;"

	            ."s/"
		    . "\([^a-zA-Zабвгдеёжзийклмнопрстуфхцчшщъыьэюя]\)"
                    . "\(".$wword."\)"
		    . "$"
                    . "/\\1<span style=\"color:red; font-weight: bold;\">\\2<\/span>/g;"
		  ;
   } else {
   $pref = "^" ; 
   $sopt = "" ;
   } ;

if ( $wword ) {
   echo "<dl>\n" ;
   PassThru( "grep -E -h -i \""
   .$pref.$wword.$suff
   ."\" ".$dictionary." | sed '"

   ."s/&/\&amp;/g;"
   ."s/</\&lt;/g;"
   ."s/>/\&gt;/g;"
   ."s/\"/\&quot;/g;"

   ."s/$/<br><br>/g;"

   ."s#\[[^[]*\]#<img align=top src=\"transcription.php?&\">#g;"

   .$sopt // раскраска если поиск внутри

   ."s/ _([IVX])/ <br>\&nbsp;\&nbsp;&/g;"
   ."s/ [1-9]\. / <br>\&nbsp;\&nbsp;\&nbsp;\&nbsp;&/g;"
   ."s/_Ant:/<i>Aнтоним: <\/i>/g;"
   ."s/_Syn:/<i>Cиноним: <\/i>/g;"
   ."s/_a\./<i>имя прилагательное. <\/i>/g;"
   ."s/_adv\./<i>наречие. <\/i>/g;"
   ."s/_artic\./<i>артикль. <\/i>/g;"
   ."s/_attr\./<i>в качестве определения. <\/i>/g;"
   ."s/_cj\./<i>союз. <\/i>/g;"
   ."s/_comp\./<i>сравнительная степень. <\/i>/g;"
   ."s/_conj\./<i>союзное местоимение. <\/i>/g;"
   ."s/_demonstr\./<i>указательное местоимение. <\/i>/g;"
   ."s/_emph\./<i>усилительное (местоимение). <\/i>/g;"
   ."s/_f\./<i>женский род. <\/i>/g;"
   ."s/_imp\./<i>повелительное наклонение. <\/i>/g;"
   ."s/_impers\./<i>безличная форма. <\/i>/g;"
   ."s/_indef\./<i>неопределенное местоимение. <\/i>/g;"
   ."s/_inf\./<i>неопределенная форма глагола. <\/i>/g;"
   ."s/_inter\./<i>(pronoun) вопросительное (местоимение). <\/i>/g;"
   ."s/_interj\./<i>междометие. <\/i>/g;"
   ."s/_invar\./<i>неизменяемый. <\/i>/g;"
   ."s/_m\./<i>мужской род. <\/i>/g;"
   ."s/_mis\./<i>неправильное употребление. <\/i>/g;"
   ."s/_n-card\./<i>количественное числительное. <\/i>/g;"
   ."s/_n\./<i>существительное. <\/i>/g;"
   ."s/_n-ord.\./<i>порядковое числительное. <\/i>/g;"
   ."s/_neg\./<i>отрицательный. <\/i>/g;"
   ."s/_obj\./<i>косвенный падеж. <\/i>/g;"
   ."s/_p-p\./<i>причастие прошедшего времени. <\/i>/g;"
   ."s/_pres-p\./<i>причастие настоящего времени. <\/i>/g;"
   ."s/_p\./<i>прошлое. <\/i>/g;"
   ."s/_pass\./<i>страдательный залог. <\/i>/g;"
   ."s/_pers\./<i>личное местоимение. <\/i>/g;"
   ."s/_pf\./<i>совершенный вид. <\/i>/g;"
   ."s/_pl\./<i>множественное число. <\/i>/g;"
   ."s/_poss\./<i>притяжательное местоимение. <\/i>/g;"
   ."s/_predic\./<i>употребление в именной части сказуемого. <\/i>/g;"
   ."s/_pref\./<i>приставка. <\/i>/g;"
   ."s/_prep\./<i>предлог. <\/i>/g;"
   ."s/_pres\./<i>настоящее время. <\/i>/g;"
   ."s/_pron\./<i>местоимение. <\/i>/g;"
   ."s/_recipr\./<i>взаимное местоимение. <\/i>/g;"
   ."s/_refl\./<i>возвратное местоимение. <\/i>/g;"
   ."s/_rel\./<i>относительное местоимение. <\/i>/g;"
   ."s/_sg\./<i>единственное число. <\/i>/g;"
   ."s/_subj\./<i>именительный падеж. <\/i>/g;"
   ."s/_suf\./<i>суффикс. <\/i>/g;"
   ."s/_sup\./<i>превосходная степень. <\/i>/g;"
   ."s/_v\./<i>глагол. <\/i>/g;"
   ."s/_ав\./<i>авиация. <\/i>/g;"
   ."s/_австрал\./<i>австралийский. <\/i>/g;"
   ."s/_авт\./<i>автомобилизм. <\/i>/g;"
   ."s/_ам\./<i>американский, употребляется в США. <\/i>/g;"
   ."s/_ак\./<i>акустика. <\/i>/g;"
   ."s/_анат\./<i>анатомия. <\/i>/g;"
   ."s/_антр\./<i>антропология. <\/i>/g;"
   ."s/_араб\./<i>арабский. <\/i>/g;"
   ."s/_арт\./<i>артиллерия. <\/i>/g;"
   ."s/_археол\./<i>археология. <\/i>/g;"
   ."s/_архит\./<i>зодчество, архитектура. <\/i>/g;"
   ."s/_астр\./<i>астрономия. <\/i>/g;"
   ."s/_афр\./<i>африканский. <\/i>/g;"
   ."s/_бакт\./<i>бактериология. <\/i>/g;"
   ."s/_банк\./<i>банковое дело. <\/i>/g;"
   ."s/_библ\./<i>библейский. <\/i>/g;"
   ."s/_биол\./<i>биология. <\/i>/g;"
   ."s/_биох\./<i>биохимия. <\/i>/g;"
   ."s/_бирж\./<i>биржевое выражение. <\/i>/g;"
   ."s/_бот\./<i>ботаника. <\/i>/g;"
   ."s/_бран\./<i>бранное. <\/i>/g;"
   ."s/_брит\./<i>употребляется в Британии. <\/i>/g;"
   ."s/_буд\./<i>буддисткое. <\/i>/g;"
   ."s/_бухг\./<i>бухгалтерское дело. <\/i>/g;"
   ."s/_бумагодел\./<i>бумагоделательное. <\/i>/g;"
   ."s/_венг\./<i>венгерский. <\/i>/g;"
   ."s/_вет\./<i>ветеринарный. <\/i>/g;"
   ."s/_воен\./<i>военный. <\/i>/g;"
   ."s/_геогр\./<i>география. <\/i>/g;"
   ."s/_геод\./<i>геодезический. <\/i>/g;"
   ."s/_геол\./<i>геология. <\/i>/g;"
   ."s/_геом\./<i>геометрия. <\/i>/g;"
   ."s/_геральд\./<i>геральдический. <\/i>/g;"
   ."s/_гидр\./<i>гидрология. <\/i>/g;"
   ."s/_гл\./<i>глагол. <\/i>/g;"
   ."s/_горн\./<i>горное дело. <\/i>/g;"
   ."s/_грам\./<i>грамматика. <\/i>/g;"
   ."s/_греч\./<i>греческое. <\/i>/g;"
   ."s/_груб\./<i>грубый; вульгарный; пошлый. <\/i>/g;"
   ."s/_датс\./<i>датское. <\/i>/g;"
   ."s/_детск\./<i>детское выражение. <\/i>/g;"
   ."s/_диал\./<i>диалект; наречие; говор. <\/i>/g;"
   ."s/_дип\./<i>дипломатия. <\/i>/g;"
   ."s/_дор\./<i>дорожное дело. <\/i>/g;"
   ."s/_др-греч\./<i>древне-греческий. <\/i>/g;"
   ."s/_др-евр\./<i>древнееврейский. <\/i>/g;"
   ."s/_др-рим\./<i>древне-римское. <\/i>/g;"
   ."s/_ж-д\./<i>железнодорожный. <\/i>/g;"
   ."s/_жарг\./<i>сленг; жаргон. <\/i>/g;"
   ."s/_жив\./<i>живопись. <\/i>/g;"
   ."s/_зоол\./<i>зоология. <\/i>/g;"
   ."s/_инд\./<i>индийский. <\/i>/g;"
   ."s/_ирл\./<i>. <\/i>/g;"
   ."s/_ирон\./<i>иронический. <\/i>/g;"
   ."s/_иск\./<i>искусство. <\/i>/g;"
   ."s/_исп\./<i>испанский язык. <\/i>/g;"
   ."s/_ист\./<i>история. <\/i>/g;"
   ."s/_ит\./<i>итальянский. <\/i>/g;"
   ."s/_канц\./<i>канцелярское выражение. <\/i>/g;"
   ."s/_карт\./<i>карточный термин. <\/i>/g;"
   ."s/_кин\./<i>кинематография. <\/i>/g;"
   ."s/_кит\./<i>китайский. <\/i>/g;"
   ."s/_книж\./<i>книжное выражение. <\/i>/g;"
   ."s/_ком\./<i>торговля, коммерция. <\/i>/g;"
   ."s/_комп\./<i>вычислительная техника. <\/i>/g;"
   ."s/_косм\./<i>космонавтика. <\/i>/g;"
   ."s/_кул\./<i>кулинарный; кухонный. <\/i>/g;"
   ."s/_ласк\./<i>ласкательное выражение. <\/i>/g;"
   ."s/_лат\./<i>латинский язык. <\/i>/g;"
   ."s/_лес\./<i>лесоводство; лесное хозяйство. <\/i>/g;"
   ."s/_лингв\./<i>языкознание. <\/i>/g;"
   ."s/_лит\./<i>употребительно в литературоведении. <\/i>/g;"
   ."s/_лог\./<i>логика. <\/i>/g;"
   ."s/_малайск\./<i>малайский. <\/i>/g;"
   ."s/_мат\./<i>математика. <\/i>/g;"
   ."s/_мед\./<i>медицина, особ. терапия. <\/i>/g;"
   ."s/_метал\./<i>металлургия. <\/i>/g;"
   ."s/_метеор\./<i>метеорология. <\/i>/g;"
   ."s/_мех\./<i>механика. <\/i>/g;"
   ."s/_мин\./<i>минералогия. <\/i>/g;"
   ."s/_миф\./<i>мифология. <\/i>/g;"
   ."s/_мор\./<i>морской; мореходный. <\/i>/g;"
   ."s/_муз\./<i>музыка. <\/i>/g;"
   ."s/_нем\./<i>германский, немецкий. <\/i>/g;"
   ."s/_неодобр\./<i>неодобрительный. <\/i>/g;"
   ."s/_норв\./<i>норвежский. <\/i>/g;"
   ."s/_обыкн\./<i>обыкновенно. <\/i>/g;"
   ."s/_опт\./<i>оптика. <\/i>/g;"
   ."s/_особ\./<i>особенно. <\/i>/g;"
   ."s/_отриц\./<i>отрицательно. <\/i>/g;"
   ."s/_охот\./<i>охота. <\/i>/g;"
   ."s/_палеонт\./<i>палеонтология. <\/i>/g;"
   ."s/_парл\./<i>парламентское выражение. <\/i>/g;"
   ."s/_перен\./<i>в переносном значении. <\/i>/g;"
   ."s/_перс\./<i>персидский. <\/i>/g;"
   ."s/_полигр\./<i>типографское дело. <\/i>/g;"
   ."s/_полит\./<i>политика. <\/i>/g;"
   ."s/_полит-эк\./<i>политическая экономия. <\/i>/g;"
   ."s/_польск\./<i>польский язык. <\/i>/g;"
   ."s/_португ\./<i>португальский. <\/i>/g;"
   ."s/_посл\./<i>пословица. <\/i>/g;"
   ."s/_поэт\./<i>поэтическое выражение. <\/i>/g;"
   ."s/_презр\./<i>презрительный; пренебрежительный. <\/i>/g;"
   ."s/_преим\./<i>преимущественно. <\/i>/g;"
   ."s/_пренебр\./<i>пренебрежительно. <\/i>/g;"
   ."s/_психол\./<i>психология. <\/i>/g;"
   ."s/_рад\./<i>радио. <\/i>/g;"
   ."s/_разг\./<i>разговорное. <\/i>/g;"
   ."s/_распр\./<i>в распространенном, неточном значении. <\/i>/g;"
   ."s/_редк\./<i>редкий. <\/i>/g;"
   ."s/_рез\./<i>резиновая промышленность. <\/i>/g;"
   ."s/_рел\./<i>религиозное. <\/i>/g;"
   ."s/_ритор\./<i>риторика. <\/i>/g;"
   ."s/_рус\./<i>русское. <\/i>/g;"
   ."s/_санскр\./<i>санскритский. <\/i>/g;"
   ."s/_с-х\./<i>сельское хозяйство. <\/i>/g;"
   ."s/_сев\./<i>северные, употребительно на севере Англии и в Шотландии. <\/i>/g;"
   ."s/_сканд\./<i>скандинавский. <\/i>/g;"
   ."s/_собир\./<i>собирательное имя существительное. <\/i>/g;"
   ."s/_сокр\./<i>аббревиатура, сокращение, сокращенно. <\/i>/g;"
   ."s/_стих\./<i>стихосложение. <\/i>/g;"
   ."s/_стр\./<i>строительство, стройка. <\/i>/g;"
   ."s/_страх\./<i>страхование. <\/i>/g;"
   ."s/_студ\./<i>студенческий. <\/i>/g;"
   ."s/_спорт\./<i>спортивный. <\/i>/g;"
   ."s/_театр\./<i>театр. <\/i>/g;"
   ."s/_текст\./<i>ткани. <\/i>/g;"
   ."s/_тел\./<i>телефон; телеграф. <\/i>/g;"
   ."s/_тлв\./<i>телевидение. <\/i>/g;"
   ."s/_тех\./<i>техника; технология. <\/i>/g;"
   ."s/_тж\./<i>также. <\/i>/g;"
   ."s/_топ\./<i>топография. <\/i>/g;"
   ."s/_тур\./<i>турецкий. <\/i>/g;"
   ."s/_уменьш\./<i>уменьшительная форма. <\/i>/g;"
   ."s/_унив\./<i>университет. <\/i>/g;"
   ."s/_употр\./<i>употребительно, употребляется. <\/i>/g;"
   ."s/_уст\./<i>вышедший из употребления; архаизм. <\/i>/g;"
   ."s/_фарм\./<i>фармацевтика. <\/i>/g;"
   ."s/_физ\./<i>физика. <\/i>/g;"
   ."s/_физиол\./<i>физиология. <\/i>/g;"
   ."s/_филос\./<i>философия. <\/i>/g;"
   ."s/_фин\./<i>финансовый. <\/i>/g;"
   ."s/_фон\./<i>фонетика. <\/i>/g;"
   ."s/_фот\./<i>фотография. <\/i>/g;"
   ."s/_фр\./<i>французский. <\/i>/g;"
   ."s/_хим\./<i>химия. <\/i>/g;"
   ."s/_хир\./<i>хирургия. <\/i>/g;"
   ."s/_церк\./<i>церковное выражение. <\/i>/g;"
   ."s/_шахм\./<i>термин. <\/i>/g;"
   ."s/_школ\./<i>школьное. <\/i>/g;"
   ."s/_шотл\./<i>шотландский. <\/i>/g;"
   ."s/_шутл\./<i>шутливый; комический. <\/i>/g;"
   ."s/_эвф\./<i>эвфемистический. <\/i>/g;"
   ."s/_эк\./<i>экономика; народное хозяйство. <\/i>/g;"
   ."s/_эл\./<i>электричество. <\/i>/g;"
   ."s/_энт\./<i>энтомология. <\/i>/g;"
   ."s/_этн\./<i>этнография. <\/i>/g;"
   ."s/_ю-ам\./<i>употребляется в Южной Америке. <\/i>/g;"
   ."s/_ю-афр\./<i>употребляется в Южной Африке. <\/i>/g;"
   ."s/_юр\./<i>юридический, правовой. <\/i>/g;"
   ."s/_яп\./<i>японский. <\/i>/g;"
   ."s/_//g;"
   ."s/= /<i>Cиноним: <\/i> /g;"
   ."s/\( [1-9][0-9]*\)&gt; "
   . "/ <br>\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\\1) /g;"
   ."s/\( [абвгдеёжзийклмнопрстуфхцчшщъыьэюя]\)&gt; "
   ."/ <br>\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\&nbsp;\\1) /g;"
   ."s#^\(.*\)  \(.*\)$#<dt>\\1<dd>\\2#g;"
   ."'" ) ;
   echo "</dl\n>" ;
   } else echo "Здесь будет результат.<br>"
     ." Словарь англо-русский, поэтому поиск с начала статьи - перевод"
     ." с английского. Поиск внутри статьи работает как для английских так и"
     ." для русских слов.<br>" 
     ." Внутри слова символ '*' заменяет любую последовательность знаков,"
     ." т.е. 'крок*л' найдёт и 'крокодил' и 'микроклимат'."
     ;

echo "<hr>\n" ;
//phpinfo() ;
?>
<div style="color:#363636;">
V.K.Mueller's English-Russian Dictionary 24 Edition, Electronic Version by<br>
E.S.Cymbalyuk 1999-2000 and Pavel Puchkov 2013 under GNU GPL, ver. 1.0<br> 
PHP5/HTML5 interface designed by <a href="mailto:0x6368656174@gmail.com">Pavel Puchkov</a> 2013.<br>
PHP3 interface designed by <a href="mailto:V.Fyodorov@VAZ.ru">V.A.Fyodorov</a> 2000.<br>
</div>

</body>
